fanjunwei0211/graduation_proj/stm32/NimotionMotor/Nimotion/NiMotionMotorSDK.c
/******************************************************************************
  *
  *   Copyright (C), 2010-2018, Beijing NiMotion Control Technology Co., Ltd.
  *
  *****************************************************************************
  *@file       : NiMotionMotorSDK.c
  *@version    : Initial Draft
  *@author     : Nimotion
  *@date       : 2019/7/12
  *@brief      :
  *****************************************************************************
  **function   :
								本程序为北京立迈胜控制技术有限公司控制MODBUS通信电机程序模板


								本程序版权为北京立迈胜控制技术有限公司所有
								未经本公司允许，不可转作其他商业用途
								如因非法转载造成一切意外事故，均与本公司无任何责任关系
  *History     :
  *@date       : 2019/7/12
  *@author     : Nimotion
  *@note       : Created file

  ****************************************************************************/

#include "stm32f10x.h"
#include "NiMotionMotorSDK.h"
#include "systick.h"
#include "bsp_timer.h"
#include "stdint.h"
#include "string.h"
/**---------------------------------------------*
  *external variables                           *
  *---------------------------------------------*/

/**---------------------------------------------*
  *constants                                    *
  *---------------------------------------------*/

/**---------------------------------------------*
  *macros                                       *
  *---------------------------------------------*/

/**---------------------------------------------*
  *project-wide global variables                *
  *---------------------------------------------*/
uint8_t buffer[20] = {0};
/**---------------------------------------------*
  *module-wide global variables                 *
  *---------------------------------------------*/

/**---------------------------------------------*
  *external routine prototypes                  *
  *---------------------------------------------*/

/**---------------------------------------------*
  *internal routine prototypes                  *
  *---------------------------------------------*/

/**---------------------------------------------*
  *routines' implementations                    *
  *---------------------------------------------*/
////=========================================================================//
////                                                                         //
////          P U B L I C   F U N C T I O N S                                //
////                                                                         //
////=========================================================================//

///***********************通信设备操作函数****************************/


/********************************************************
  * @brief      : NiM_isMotorOnline
  * @details    : 判断电机是否在线
  * @param [in] : nAddr：   电机地址Node-ID   取值范围： 1~247

	* @param [out]: *pParamValue                返回数据：0：电机不在线，其他：电机在线
	* @retval     :0 成功，其它表示错误码
  * Calls       :
  * Called By   :

  * History
  * @date       : 2019/6/17
  *	@author     : Nimotion

  *
  ********************************************************/
uint32_t NiM_isMotorOnline(uint32_t nAddr, uint32_t *pOnline)
{
    if(NiM_readParam(nAddr, 0x17, 0x02, pOnline) == RETURN_SUCCESS)
    {

        return RETURN_SUCCESS;
    }
    else
    {
        *pOnline = 0;
        return TIMEOUT_ERROR;
    }
}

/********************************************************
  * @brief      : NiM_getMotorInfo
  * @details    : 获取电机基本信息
  * @param [in] : nAddr：   电机地址Node-ID   取值范围： 1~247

  * @param [out]: pInfo：   电机信息
  * @retval     :0 成功，其它表示错误码
  * Calls       :
  * Called By   :

  * History
  * @date       : 2019/6/17
  *	@author     : Nimotion

  *
  ********************************************************/

uint32_t NiM_getMotorInfo(uint32_t nAddr, MOTOR_INFO* pInfo)
{
		uint32_t error=0;//错误状态返回值
    uint16_t crc16 = 0;//16位CRC校验码
	//组合要发送的报文
    buffer[0] = nAddr;
    buffer[1] = 0x04;
    buffer[2] = 0x00;
    buffer[3] = 0x02;
    buffer[4] = 0x00;
    buffer[5] = 0X02;

    crc16 = usMBCRC16(buffer, 6);
    buffer[6] = (uint8_t)(crc16 & 0xff);
    buffer[7] = (uint8_t)(crc16 >> 8);

    USART_Send_Buffer(buffer, 8);//发送数据

    Delay_ms(1);//延时等待发送完成
	
		Timer = 0;//定时器计数清零
    while(Timer < 2000)//2s超时
    {
			/* BEGIN:   PN:3 */	
			if(RTU_FLAG==1)//收到一帧完整数据
			{
				if(RS485_RX_BUF[0] == nAddr)//判断接收到的数据是不是正确的电机发出的
				{
					if(RS485_RX_BUF[1] > 0x80)//判断电机是否故障
					{
						switch(RS485_RX_BUF[2])//如果电机有异常，返回相应的异常状态
						{
							case 0x01: 
								error= ILLEGAL_FUNCTION;
							break;
							case 0x02:
								error= ILLEGAL_DATA_ADDRESS;
							break;
							case 0x03:
								error= ILLEGAL_DATA_VALUE;
							break;
							case 0x04:
								error= SLAVE_DEVICE_FAILURE;
							break;
							case 0x05:
								error = ACKNOWLEDGE;
							break;
							case 0x06:
								error = SLAVE_BUSY;
							break;
							case 0x0C:
								error = MOTOR_ALARM;
							break;							
							default:
								error= SLAVE_DEVICE_FAILURE;
							break;
						
						}
						memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
						RS485_RX_CNT=0;//接收重新计数
						Timer=0;//定时器计数清零

						return error;
					}
					else
					{
						if((RS485_RX_BUF[1] == buffer[1]) && (RS485_RX_BUF[2] == 0X04))//在电机非故障状态下，判断接收到的数据是否有问题
						{
							//存储电机信息数据
							  pInfo->szSerialNumber[0] = RS485_RX_BUF[3];
								pInfo->szSerialNumber[1] = RS485_RX_BUF[4];
								pInfo->szSerialNumber[2] = RS485_RX_BUF[5];
								pInfo->szSerialNumber[3] = RS485_RX_BUF[6];
								memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
								RS485_RX_CNT=0;//接收重新计数
								Timer = 0;//定时器计数清零
								break;
						}
					}
					
				}
				memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
				RS485_RX_CNT=0;//接收重新计数
				RTU_FLAG=0;//清除接收完成标志位
			}
    }
		
		if(Timer >=2000)//判断是否接收超时
		{
			Timer=0;//定时器计数清零
			return TIMEOUT_ERROR;//返回超时
		}
	//组合要发送的报文
    buffer[0] = nAddr;
    buffer[1] = 0x04;
    buffer[2] = 0x00;
    buffer[3] = 0x04;
    buffer[4] = 0x00;
    buffer[5] = 0X02;

    crc16 = usMBCRC16(buffer, 6);
    buffer[6] = (uint8_t)(crc16 & 0xff);
    buffer[7] = (uint8_t)(crc16 >> 8);

    USART_Send_Buffer(buffer, 8);//发送数据
    Delay_ms(1);//延时等待发送完成
		Timer = 0;//定时器计数清零
    while(Timer < 2000)//2s超时
    {
			if(RTU_FLAG == 1)//收到一帧完整数据
			{
					if(RS485_RX_BUF[0] == nAddr)//判断接收到的数据是不是正确的电机发出的
						{
							if(RS485_RX_BUF[1] > 0x80)//判断电机是否故障
							{
									switch(RS485_RX_BUF[2])//如果电机有异常，返回相应的异常状态
									{
										case 0x01: 
											error= ILLEGAL_FUNCTION;
										break;
										case 0x02:
											error= ILLEGAL_DATA_ADDRESS;
										break;
										case 0x03:
											error= ILLEGAL_DATA_VALUE;
										break;
										case 0x04:
											error= SLAVE_DEVICE_FAILURE;
										break;
										case 0x05:
											error = ACKNOWLEDGE;
										break;
										case 0x06:
											error = SLAVE_BUSY;
										break;
										case 0x0C:
											error = MOTOR_ALARM;
										break;										
										default:
											error= SLAVE_DEVICE_FAILURE;
										break;
									
