fanjunwei0211/graduation_proj/stm32/NimotionMotor/Nimotion/NiMotionMotorSDK.c
									}
									memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
									RS485_RX_CNT=0;//接收重新计数
									Timer=0;//定时器计数清零
									return error;//返回故障码
								/* END:   PN:3 */	
							}
							else
							{

									if((RS485_RX_BUF[1] == buffer[1]) && (RS485_RX_BUF[2] == 0X02))//在电机非故障状态下，判断接收到的数据是否有问题
								{
									//存储电机信息数据
										*pAlarmCode = (uint32_t)((RS485_RX_BUF[3] << 8) + (RS485_RX_BUF[4] << 0));
									
										memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
										RS485_RX_CNT=0;//接收重新计数
										Timer = 0;//定时器计数清零
										break;
								}

						}
					}
					memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
					RS485_RX_CNT=0;//接收重新计数
					RTU_FLAG=0;//清除接收完成标志位
				}
    }
		memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
		if(Timer >=2000)//判断是否接收超时
		{
			Timer=0;//定时器计数清零
			return TIMEOUT_ERROR;//返回超时
		}
		else 
		{
			Timer = 0;//定时器计数清零
			return RETURN_SUCCESS;//返回成功
		}

		Timer = 0;
    while(Timer < 2000)
    {

        if((RS485_RX_BUF[0] == nAddr) && (RS485_RX_BUF[1] == buffer[1]) && (RS485_RX_BUF[2] == 0X02))
        {

            *pAlarmCode = (uint32_t)((RS485_RX_BUF[3] << 8) + (RS485_RX_BUF[4] << 0));
            memset(RS485_RX_BUF, 0, 64);

            Timer = 0;
            return 0;

        }

    }
    Timer = 0;
    return 1;
}

/********************************************************
  * @brief      : NiM_getErrorCode
  * @details    : 获取电机故障码
  * @param [in] : nAddr：   电机地址Node-ID   取值范围： 1~247

  * @param [out]: pErrorCode： 返回错误寄存器值 			 读取值请参考《一体化步进电机CAN通讯用户手册(闭环).pdf》第8.6章
  * @retval     :0 成功，其它表示错误码
  * Calls       :
  * Called By   :

  * History
  * @date       : 2019/6/17
  *	@author     : Nimotion

  *
  ********************************************************/
uint32_t NiM_getErrorCode(uint32_t nAddr, uint32_t* pErrorCode)
{
	return NiM_readParam(nAddr,0x1025,2,pErrorCode);
}

/********************************************************
  * @brief      : NiM_getHistoryAlarms
  * @details    : 获取电机历史报警
  * @param [in] : nAddr：   电机地址Node-ID   取值范围： 1~247

  * @param [out]: pAlarmCode： 返回报警值		读取值请参考《一体化步进电机CAN通讯用户手册(闭环).pdf》第8.6章
									pCount ：    返回报警数量	读取值请参考《一体化步进电机CAN通讯用户手册(闭环).pdf》第8.6章
  * @retval     :0 成功，其它表示错误码
  * Calls       :
  * Called By   :

  * History
  * @date       : 2019/6/17
  *	@author     : Nimotion

  *
  ********************************************************/
uint32_t NiM_getHistoryAlarms(uint32_t nAddr, uint32_t * pAlarmCode, uint32_t*  pCount)
{
    uint8_t i = 0, m = 0;


    for(i = 1; i < 9; i++)
    {
        NiM_getAlarm(nAddr, &pAlarmCode[m], i);
        if(pAlarmCode[m] != 0)
        {
            m++;
        }
    }
    *pCount = m;
    return 0;
}

/********************************************************
  * @brief      : NiM_clearAlarms
  * @details    : 清除电机报警
  * @param [in] : nAddr：   电机地址Node-ID   取值范围： 1~247

  * @param [out]: 无
  * @retval     :0 成功，其它表示错误码
  * Calls       :
  * Called By   :

  * History
  * @date       : 2019/6/17
  *	@author     : Nimotion

  *
  ********************************************************/
uint32_t NiM_clearAlarms(uint32_t nAddr)
{
    return  NiM_writeParam(nAddr, 0x73, 2, 0x6c64);
}

/********************************************************
  * @brief      : NiM_clearErrorState
  * @details    : 清除电机故障
  * @param [in] : nAddr：   电机地址Node-ID   取值范围： 1~247

  * @param [out]: 无
  * @retval     :0 成功，其它表示错误码
  * Calls       :
  * Called By   :

  * History
  * @date       : 2019/6/17
  *	@author     : Nimotion

  *
  ********************************************************/
uint32_t NiM_clearErrorState(uint32_t nAddr)
{
    return  NiM_writeParam(nAddr, 0x51, 2, 0x0080);
}
/**********************电机控制函数******************************/

/********************************************************
  * @brief      : NiM_readParam
  * @details    : 获取电机参数
  * @param [in] : nAddr：   电机地址Node-ID   取值范围： 1~247
	                nParamID：子索引
  * @param [out]: *pParamValue
  * @retval     :0 成功，其它表示错误码
  * Calls       :
  * Called By   :

  * History
  * @date       : 2019/6/17
  *	@author     : Nimotion
  *   @note     :
  *
  ********************************************************/
uint32_t NiM_readParam(uint32_t nAddr, uint32_t nParamID, uint32_t nBytes, uint32_t  *pParamValue)
{
		uint32_t i=0;
		uint32_t error=0;//错误状态返回值
    uint16_t crc16 = 0;//16位CRC校验码
		//组合要发送的报文
     buffer[0] = nAddr;

    if(nParamID > 0x1000)
    {
        buffer[1] = 0x04;
    }
    else
    {
        buffer[1] = 0x03;
    }
    buffer[2] = 0x00;
    buffer[3] = nParamID & 0xff;
    buffer[4] = 0x00;
    buffer[5] = nBytes / 2;

    crc16 = usMBCRC16(buffer, 6);
    buffer[6] = (uint8_t)(crc16 & 0xff);
    buffer[7] = (uint8_t)((crc16 >> 8) & 0xff);

    USART_Send_Buffer(buffer, 8);//发送数据
    Delay_ms(1);//延时等待发送完成
		Timer = 0;//定时器计数清零
    while(Timer < 2000)//2s超时
    {
			/* BEGIN:   PN:3 */	
			if(RTU_FLAG == 1)//收到一帧完整数据
			{
					if(RS485_RX_BUF[0] == nAddr)//判断接收到的数据是不是正确的电机发出的
					{
							if(RS485_RX_BUF[1] > 0x80)//判断电机是否故障
							{
									switch(RS485_RX_BUF[2])//如果电机有异常，返回相应的异常状态
									{
										case 0x01: 
											error= ILLEGAL_FUNCTION;
										break;
										case 0x02:
											error= ILLEGAL_DATA_ADDRESS;
										break;
										case 0x03:
											error= ILLEGAL_DATA_VALUE;
										break;
										case 0x04:
											error= SLAVE_DEVICE_FAILURE;
										break;
										case 0x05:
											error = ACKNOWLEDGE;
										break;
										case 0x06:
											error = SLAVE_BUSY;
										break;
										case 0x0C:
										error = MOTOR_ALARM;
										break;	
										default:
											error= SLAVE_DEVICE_FAILURE;
										break;
									
									}
									memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
									RS485_RX_CNT=0;//接收重新计数
									Timer=0;//定时器计数清零
									return error;//返回故障码
								/* END:   PN:3 */	
							}
							else
							{

									if((RS485_RX_BUF[1] == buffer[1]) && (RS485_RX_BUF[2] == nBytes))//在电机非故障状态下，判断接收到的数据是否有问题
								{
									//存储电机信息数据
									for(i=0;i<(nBytes/2);i++)
									{
										*pParamValue = (uint32_t)((RS485_RX_BUF[3+i*2] << 8) + (RS485_RX_BUF[4+i*2] << 0));
										pParamValue++;
									}

									memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
									RS485_RX_CNT=0;//接收重新计数
									Timer = 0;//定时器计数清零
									break;
								}


