fanjunwei0211/graduation_proj/stm32/NimotionMotor/Nimotion/NiMotionMotorSDK.c
							}
					}
				memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
				RS485_RX_CNT=0;//接收重新计数
				RTU_FLAG=0;//清除接收完成标志位
			}
    }
		memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
		if(Timer >=2000)//判断是否接收超时
		{
			Timer=0;//定时器计数清零
			return TIMEOUT_ERROR;//返回超时
		}
		else 
		{
			Timer = 0;//定时器计数清零
			return RETURN_SUCCESS;//返回成功
		}

   

}
/********************************************************
  * @brief      : NiM_writeParam
  * @details    : 获取电机参数
  * @param [in] : nAddr：   电机地址Node-ID
	                nParamID：子索引
									nBytes 字节数
	                pParamValue
  * @param [out]: 无
  * @retval     :0 成功，其它表示错误码
  * Calls       :
  * Called By   :

  * History
  * @date       : 2019/6/17
  *	@author     : Nimotion
  * @note     :
  *
  ********************************************************/
uint32_t NiM_writeParam(uint32_t nAddr, uint32_t nParamID, uint32_t nBytes, uint32_t nParamValue)
{
		uint32_t i=0;
		uint32_t error=0;//错误状态返回值
    uint16_t crc16 = 0;//16位CRC校验码
		//组合要发送的报文
    buffer[0] = nAddr;
    buffer[1] = 0x06;
    buffer[2] = 0x00;
    buffer[3] = nParamID & 0xff;
    buffer[4] = (uint8_t)((nParamValue >> 8) & 0xff);
    buffer[5] = (uint8_t)(nParamValue & 0xff);

    crc16 = usMBCRC16(buffer, 6);
    buffer[6] = (uint8_t)(crc16 & 0xff);
    buffer[7] = (uint8_t)(crc16 >> 8);
		Delay_ms(1);//延时等待发送完成
    USART_Send_Buffer(buffer, 8);//发送数据
    Delay_ms(1);//延时等待发送完成
		Timer = 0;//定时器计数清零
    while(Timer < 2000)//2s超时
    {
			/* BEGIN:   PN:3 */	
			if(RTU_FLAG == 1)//收到一帧完整数据
			{
					if(RS485_RX_BUF[0] == nAddr)//判断接收到的数据是不是正确的电机发出的
					{
							if(RS485_RX_BUF[1] > 0x80)//判断电机是否故障
							{
									switch(RS485_RX_BUF[2])//如果电机有异常，返回相应的异常状态
									{
										case 0x01: 
											error= ILLEGAL_FUNCTION;
										break;
										case 0x02:
											error= ILLEGAL_DATA_ADDRESS;
										break;
										case 0x03:
											error= ILLEGAL_DATA_VALUE;
										break;
										case 0x04:
											error= SLAVE_DEVICE_FAILURE;
										break;
										case 0x05:
											error = ACKNOWLEDGE;
										break;
										case 0x06:
											error = SLAVE_BUSY;
										break;
										case 0x0C:
										error = MOTOR_ALARM;
										break;	
										default:
											error= SLAVE_DEVICE_FAILURE;
										break;
									
									}
									memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
									RS485_RX_CNT=0;//接收重新计数
									Timer=0;//定时器计数清零
									return error;//返回故障码
								/* BEGIN:   PN:3 */	
							}
							else
							{

									if((RS485_RX_BUF[1] == buffer[1]) && (RS485_RX_BUF[3] == nParamID) && (RS485_RX_BUF[5] == buffer[5]))//在电机非故障状态下，判断接收到的数据是否有问题
								{
									

									memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
									RS485_RX_CNT=0;//接收重新计数
									Timer = 0;//定时器计数清零
									break;
								}


							}
					}
				memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
				RS485_RX_CNT=0;//接收重新计数
				RTU_FLAG=0;//清除接收完成标志位
			}
    }
		memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
		if(Timer >=2000)//判断是否接收超时
		{
			Timer=0;//定时器计数清零
			return TIMEOUT_ERROR;//返回超时
		}
		else 
		{
			Timer = 0;//定时器计数清零
			return RETURN_SUCCESS;//返回成功
		}

}

/********************************************************
  * @brief      : NiM_saveParams
  * @details    : 保存电机参数
  * @param [in] : nAddr：   电机地址Node-ID

  * @param [out]: 无
  * @retval     :0 成功，其它表示错误码
  * Calls       :
  * Called By   :

  * History
  * @date       : 2019/6/17
  *	@author     : Nimotion
  *
  ********************************************************/
uint32_t NiM_saveParams(uint32_t nAddr)
{
	return NiM_writeParam(nAddr,0x08,2,0x7376);
}

/********************************************************
  * @brief      : NiM_restoreFactorySettings
  * @details    : 恢复电机出厂设置
  * @param [in] : nAddr：   电机地址Node-ID

  * @param [out]: 无
  * @retval     :0 成功，其它表示错误码
  * Calls       :
  * Called By   :

  * History
  * @date       : 2019/6/17
  *	@author     : Nimotion
  *
  ********************************************************/
uint32_t NiM_restoreFactorySettings(uint32_t nAddr)
{
		return NiM_writeParam(nAddr,0x0B,2,0x6c64);

}

/********************************************************
  * @brief      : NiM_changeAddr
  * @details    : 修改电机地址
  * @param [in] : nCurAddr：   电机当前地址Node-ID
									nNewAddr：   电机新地址Node-ID
  * @param [out]: 无
  * @retval     :0 成功，其它表示错误码
  * Calls       :
  * Called By   :

  * History
  * @date       : 2019/6/17
  *	@author     : Nimotion
  *
  ********************************************************/
uint32_t NiM_changeAddr(uint32_t nCurAddr, uint32_t nNewAddr)
{
		return NiM_writeParam(nCurAddr,0x00,2,nNewAddr);
}

/********************************************************
  * @brief      : NiM_changeWorkMode
  * @details    : 修改电机运行模式
  * @param [in] : nAddr：   电机地址Node-ID
									nMode：   电机运行模式
  * @param [out]: 无
  * @retval     :0 成功，其它表示错误码
  * Calls       :
  * Called By   :

  * History
  * @date       : 2019/6/17
  *	@author     : Nimotion
  *
  ********************************************************/

uint32_t NiM_changeWorkMode(uint32_t nAddr, WORK_MODE nMode)
{
		return NiM_writeParam(nAddr,0x39,2,nMode);
}

/********************************************************
  * @brief      : NiM_getCurrentStatus
  * @details    : 获取电机状态字
  * @param [in] : nAddr：   电机地址Node-ID

  * @param [out]: pStatusWord：  返回状态字
  * @retval     :0 成功，其它表示错误码
  * Calls       :
  * Called By   :

  * History
  * @date       : 2019/6/17
  *	@author     : Nimotion
  *
  ********************************************************/
uint32_t NiM_getCurrentStatus(uint32_t nAddr, uint32_t *pStatusWord)
{
	  return NiM_readParam(nAddr,0x101F,2,pStatusWord);

}

/********************************************************
  * @brief      : NiM_getCurrentPosition
  * @details    : 获取电机当前位置
  * @param [in] : nAddr：   电机地址Node-ID   取值范围： 1~247

  * @param [out]: pPosition：  返回当前位置
  * @retval     :0 成功，其它表示错误码
  * Calls       :
  * Called By   :

  * History
  * @date       : 2019/6/17
  *	@author     : Nimotion
  *
  ********************************************************/
uint32_t NiM_getCurrentPosition(uint32_t nAddr, uint32_t* pPosition)
{
		return NiM_readParam(nAddr,0x1021,4,pPosition);
}

/********************************************************
  * @brief      : NiM_saveAsHome
  * @details    : 将电机当前位置保存为原点
  * @param [in] : nAddr：   电机地址Node-ID   取值范围： 1~247

  * @param [out]: 无
  * @retval     :0 成功，其它表示错误码
  * Calls       :
  * Called By   :

