fanjunwei0211/graduation_proj/stm32/NimotionMotor/Nimotion/NiMotionMotorSDK.c
  * History
  * @date       : 2019/6/17
  *	@author     : Nimotion
  *
  ********************************************************/
uint32_t NiM_saveAsHome(uint32_t  nAddr)
{
		 if(ActionFlag!=0)//判断运动指令使能标志位是否生效
		{
			return ACKNOWLEDGE;//返回绝对位置运行未结束
		}		
	  return NiM_writeParam(nAddr,0x0048,2,0x5348);

}



/********************************************************
  * @brief      : NiM_saveAsZero
  * @details    : 将电机当前位置保存为零点
  * @param [in] : nAddr：   电机地址Node-ID   取值范围： 1~247

  * @param [out]: 无
  * @retval     :0 成功，其它表示错误码
  * Calls       :
  * Called By   :

  * History
  * @date       : 2019/6/17
  *	@author     : Nimotion
  *
  ********************************************************/
uint32_t NiM_saveAsZero(uint32_t  nAddr)
{
		if(ActionFlag!=0)//判断运动指令使能标志位是否生效
		{
			return ACKNOWLEDGE;//返回绝对位置运行未结束
		}	
		return NiM_writeParam(nAddr,0x47,2,0x535A);
}

/********************************************************
  * @brief      : NiM_moveRelative
  * @details    : 相对位置运动
  * @param [in] : nAddr：  	 电机地址Node-ID   取值范围： 1~247
	                nDistance：运动距离
  * @param [out]: 无
  * @retval     :0 成功，其它表示错误码
  * Calls       :
  * Called By   :

  * History
  * @date       : 2019/6/17
  *	@author     : Nimotion

  *
  ********************************************************/
uint32_t NiM_moveRelative(uint32_t nAddr, int32_t nDistance)
{
		uint32_t error=0;//错误状态返回值
    uint16_t crc16 = 0;//16位CRC校验码
		 if(ActionFlag!=0)//判断运动指令使能标志位是否生效
		{
			return ACKNOWLEDGE;//返回绝对位置运行未结束
		}		
	//组合要发送的报文
		buffer[0] = nAddr;
    buffer[1] = 0x10;
    buffer[2] = 0x00;
    buffer[3] = 0x52;
    buffer[4] = 0x00;
    buffer[5] = 0x01;
    buffer[6] = 0x02;
    buffer[7] = 0x00;
    if(nDistance > 0)
    {
        buffer[8] = 0x01;
    }
    else
    {
        buffer[8] = 0x00;
        nDistance = 0 - nDistance;
    }
    crc16 = usMBCRC16(buffer, 9);
    buffer[9] = (uint8_t)(crc16 & 0xff);
    buffer[10] = (uint8_t)(crc16 >> 8);

    USART_Send_Buffer(buffer, 11);//发送数据

    Delay_ms(1);//延时等待发送完成
	
		Timer = 0;//定时器计数清零
    while(Timer < 2000)//2s超时
    {
			/* BEGIN:   PN:3 */	
			if(RTU_FLAG==1)//收到一帧完整数据
			{
				if(RS485_RX_BUF[0] == nAddr)//判断接收到的数据是不是正确的电机发出的
				{
					if(RS485_RX_BUF[1] > 0x80)//判断电机是否故障
					{
						switch(RS485_RX_BUF[2])//如果电机有异常，返回相应的异常状态
						{
							case 0x01: 
								error= ILLEGAL_FUNCTION;
							break;
							case 0x02:
								error= ILLEGAL_DATA_ADDRESS;
							break;
							case 0x03:
								error= ILLEGAL_DATA_VALUE;
							break;
							case 0x04:
								error= SLAVE_DEVICE_FAILURE;
							break;
							case 0x05:
								error = ACKNOWLEDGE;
							break;
							case 0x06:
								error = SLAVE_BUSY;
							break;
							case 0x0C:
								error = MOTOR_ALARM;
							break;								
							default:
								error= SLAVE_DEVICE_FAILURE;
							break;
						
						}
						memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
						RS485_RX_CNT=0;//接收重新计数
						Timer=0;//定时器计数清零

						return error;
					}
					else
					{
						if((RS485_RX_BUF[1] == buffer[1]) && (RS485_RX_BUF[3] == buffer[3]) && (RS485_RX_BUF[5] == buffer[5]))//在电机非故障状态下，判断接收到的数据是否有问题
						{
								memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
								RS485_RX_CNT=0;//接收重新计数
								Timer = 0;//定时器计数清零
								break;
						}
					}
					
				}
				memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
				RS485_RX_CNT=0;//接收重新计数
				RTU_FLAG=0;//清除接收完成标志位
			}
    }
		
		if(Timer >=2000)//判断是否接收超时
		{
			Timer=0;//定时器计数清零
			return TIMEOUT_ERROR;//返回超时
		}
	//组合要发送的报文
    buffer[0] = nAddr;
    buffer[1] = 0x10;
    buffer[2] = 0x00;
    buffer[3] = 0x53;
    buffer[4] = 0x00;
    buffer[5] = 0x02;
    buffer[6] = 0x04;
    buffer[7] = (nDistance >> 24) & 0xff;
    buffer[8] = (nDistance >> 16) & 0xff;
    buffer[9] = (nDistance >> 8) & 0xff;
    buffer[10] = (nDistance >> 0) & 0xff;
    crc16 = usMBCRC16(buffer, 11);
    buffer[11] = (uint8_t)(crc16 & 0xff);
    buffer[12] = (uint8_t)(crc16 >> 8);

    USART_Send_Buffer(buffer, 13);//发送数据
    Delay_ms(1);//延时等待发送完成
		Timer = 0;//定时器计数清零
    while(Timer < 2000)//2s超时
    {
			if(RTU_FLAG == 1)//收到一帧完整数据
			{
					if(RS485_RX_BUF[0] == nAddr)//判断接收到的数据是不是正确的电机发出的
						{
							if(RS485_RX_BUF[1] > 0x80)//判断电机是否故障
							{
									switch(RS485_RX_BUF[2])//如果电机有异常，返回相应的异常状态
									{
										case 0x01: 
											error= ILLEGAL_FUNCTION;
										break;
										case 0x02:
											error= ILLEGAL_DATA_ADDRESS;
										break;
										case 0x03:
											error= ILLEGAL_DATA_VALUE;
										break;
										case 0x04:
											error= SLAVE_DEVICE_FAILURE;
										break;
										case 0x05:
											error = ACKNOWLEDGE;
										break;
										case 0x06:
											error = SLAVE_BUSY;
										break;
										case 0x0C:
											error = MOTOR_ALARM;
										break;	
										default:
											error= SLAVE_DEVICE_FAILURE;
										break;
									
									}
									memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
									RS485_RX_CNT=0;//接收重新计数
									Timer=0;//定时器计数清零
									return error;//返回故障码
								
							}
							else
							{
									if((RS485_RX_BUF[1] == buffer[1]) && (RS485_RX_BUF[3] == buffer[3]) && (RS485_RX_BUF[5] == buffer[5]))//在电机非故障状态下，判断接收到的数据是否有问题
									{
											memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
											RS485_RX_CNT=0;//接收重新计数
											Timer = 0;//定时器计数清零
											break;
									}
						
					}
				}
				memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
				RS485_RX_CNT=0;//接收重新计数
				RTU_FLAG=0;//清除接收完成标志位
			}
		}

		if(Timer >=2000)//判断是否接收超时
		{
			Timer=0;//定时器计数清零
			return TIMEOUT_ERROR;//返回超时
		}
//组合要发送的报文
    buffer[0] = nAddr;
    buffer[1] = 0x10;
    buffer[2] = 0x00;
    buffer[3] = 0x51;
    buffer[4] = 0x00;
    buffer[5] = 0x01;
    buffer[6] = 0x02;
    buffer[7] = 0x00;
    buffer[8] = 0x4f;

    crc16 = usMBCRC16(buffer, 9);
    buffer[9] = (uint8_t)(crc16 & 0xff);
    buffer[10] = (uint8_t)(crc16 >> 8);

    USART_Send_Buffer(buffer, 11);//发送数据
    Delay_ms(1);//延时等待发送完成
		Timer = 0;//定时器计数清零
    while(Timer < 2000)//2s超时
    {
			if(RTU_FLAG == 1)//收到一帧完整数据
			{
					if(RS485_RX_BUF[0] == nAddr)//判断接收到的数据是不是正确的电机发出的
						{
							if(RS485_RX_BUF[1] > 0x80)//判断电机是否故障
							{
									switch(RS485_RX_BUF[2])//如果电机有异常，返回相应的异常状态
									{
										case 0x01: 
											error= ILLEGAL_FUNCTION;
										break;
										case 0x02:
											error= ILLEGAL_DATA_ADDRESS;
										break;
										case 0x03:
											error= ILLEGAL_DATA_VALUE;
										break;
										case 0x04:
											error= SLAVE_DEVICE_FAILURE;
										break;
										case 0x05:
											error = ACKNOWLEDGE;
										break;
										case 0x06:
											error = SLAVE_BUSY;
										break;
										case 0x0C:
											error = MOTOR_ALARM;
										break;											
										default:
											error= SLAVE_DEVICE_FAILURE;
										break;
									
