fanjunwei0211/graduation_proj/stm32/NimotionMotor/Nimotion/NiMotionMotorSDK.c
												}
												memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
												RS485_RX_CNT=0;//接收重新计数
												Timer=0;//定时器计数清零
												return error;//返回故障码
											/* END:   PN:3 */	
										}
										else
										{

												if((RS485_RX_BUF[1] == buffer[1]) && (RS485_RX_BUF[3] == buffer[3]) && (RS485_RX_BUF[5] == buffer[5]))//在电机非故障状态下，判断接收到的数据是否有问题
												{
														memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
														RS485_RX_CNT=0;//接收重新计数
														Timer = 0;//定时器计数清零
														break;
												}
										}
									}
								memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
								RS485_RX_CNT=0;//接收重新计数
								RTU_FLAG=0;//清除接收完成标志位
							}
					}
					memset(RS485_RX_BUF, 0, 64);//清除接收缓存区的数据
					if(Timer >=2000)//判断是否接收超时
					{
						Timer=0;//定时器计数清零
						return TIMEOUT_ERROR;//返回超时
					}
					else 
					{
						Timer = 0;//定时器计数清零
						return RETURN_SUCCESS;//返回成功
					}
		}
	
}

/********************************************************
  * @brief      : NiM_powerOn
  * @details    : 给电机驱动电路上电（抱机）
  * @param [in] : nAddr：   电机地址Node-ID   取值范围： 1~127

  * @param [out]: 无
  * @retval     :0 成功，其它表示错误码
  * Calls       :
  * Called By   :

  * History
  * @date       : 2019/6/17
  *	@author     : Nimotion

  *
  ********************************************************/
uint32_t NiM_powerOn(uint32_t nAddr)
{
		if(ActionFlag!=0)//判断运动指令使能标志位是否生效
		{
			return ACKNOWLEDGE;//返回绝对位置运行未结束
		}	
		return NiM_writeParam(nAddr,0x0051,2,0x0007);
}

/********************************************************
  * @brief      : NiM_powerOff
  * @details    : 给电机驱动电路断电（脱机）
  * @param [in] : nAddr：   电机地址Node-ID   取值范围： 1~127

  * @param [out]: 无
  * @retval     :0 成功，其它表示错误码
  * Calls       :
  * Called By   :

  * History
  * @date       : 2019/6/17
  *	@author     : Nimotion

  *
  ********************************************************/
uint32_t NiM_powerOff(uint32_t nAddr)
{
		 if(ActionFlag!=0)//判断运动指令使能标志位是否生效
		{
			return ACKNOWLEDGE;//返回绝对位置运行未结束
		}		
		return NiM_writeParam(nAddr,0x0051,2,0x0006);
}

/********************************************************
  * @brief      : NiM_stop
  * @details    : 停止当前动作
  * @param [in] : nAddr：   电机地址Node-ID   取值范围： 1~127

  * @param [out]: 无
  * @retval     :0 成功，其它表示错误码
  * Calls       :
  * Called By   :

  * History
  * @date       : 2019/6/17
  *	@author     : Nimotion

  *
  ********************************************************/
uint32_t NiM_stop(uint32_t nAddr)
{
		 if(ActionFlag!=0)//判断运动指令使能标志位是否生效
		{
			return ACKNOWLEDGE;//返回绝对位置运行未结束
		}		
	  return NiM_writeParam(nAddr,0X0051,2,0X007);
}

/********************************************************
  * @brief      : NiM_fastStop
  * @details    : 急停
  * @param [in] : nAddr：   电机地址Node-ID   取值范围： 1~127

  * @param [out]: 无
  * @retval     :0 成功，其它表示错误码
  * Calls       :
  * Called By   :

  * History
  * @date       : 2019/6/17
  *	@author     : Nimotion

  *
  ********************************************************/
uint32_t NiM_fastStop(uint32_t nAddr)
{
		if(ActionFlag!=0)//判断运动指令使能标志位是否生效
		{
			return ACKNOWLEDGE;//返回绝对位置运行未结束
		}	
		return NiM_writeParam(nAddr,0X0051,2,0X002);;
}


///**** Copyright (C)2018 Nimotion All Rights Reserved **** END OF FILE ****/

